app/controllers/premises_controller.rb

SELECT "premises".* FROM "premises"
---
  def index
    @premises = Premise.all # Получение списка всех акций

SELECT "premises".* FROM "premises" WHERE "premises"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @premise = Premise.find(params[:id])

INSERT INTO "premises" ("name", "cost", "owner", "created_at", "updated_at", "rooms", "square_meters") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["name", "vfe"], ["cost", "2.0"], ["owner", nil], ["created_at", "2024-03-10 12:36:02.603545"], ["updated_at", "2024-03-10 12:36:02.603545"], ["rooms", 3], ["square_meters", 2]]
---
  def create
    @premise = Premise.new(premise_param) # Создание новой акции с переданными параметрами


    if @premise.save

SELECT "premises".* FROM "premises" WHERE "premises"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @premise = Premise.find(params[:id])

SELECT "premises".* FROM "premises" WHERE "premises"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "premises" SET "name" = $1, "cost" = $2, "updated_at" = $3 WHERE "premises"."id" = $4  [["name", "трёшка 2"], ["cost", "442.0"], ["updated_at", "2024-03-10 10:50:48.058482"], ["id", 1]]
---
  def update
    @premise = Premise.find(params[:id])
    if @premise.update(premise_params)

SELECT "premises".* FROM "premises" WHERE "premises"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "premises" SET "owner" = $1, "updated_at" = $2 WHERE "premises"."id" = $3  [["owner", "1"], ["updated_at", "2024-03-10 10:52:25.101264"], ["id", 1]]
---
  def buy
    @premise = Premise.find(params[:id])
    @premise.owner = current_user.id
    @premise.save

SELECT "premises".* FROM "premises" WHERE "premises"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "premises" SET "owner" = $1, "updated_at" = $2 WHERE "premises"."id" = $3  [["owner", nil], ["updated_at", "2024-03-10 10:52:28.437400"], ["id", 1]]
---
  def sell
    @premise = Premise.find(params[:id])
    @premise.owner = nil
    @premise.save

SELECT "premises".* FROM "premises" WHERE "premises"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
DELETE FROM "premises" WHERE "premises"."id" = $1  [["id", 4]]
---
  def destroy
    @premise = Premise.find(params[:id])
    @premise.destroy