app/controllers/products_controller.rb

SELECT "products".* FROM "products"
---
  def index
    @products = Product.all # Получение списка всех акций

INSERT INTO "products" ("name", "cost", "owner", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "iphone"], ["cost", "323.0"], ["owner", nil], ["created_at", "2024-02-11 20:36:54.962500"], ["updated_at", "2024-02-11 20:36:54.962500"]]
---
  def create
    @product = Product.new(product_param) # Создание новой акции с переданными параметрами


    if @product.save

SELECT "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "products" SET "cost" = $1, "updated_at" = $2 WHERE "products"."id" = $3  [["cost", "3233.0"], ["updated_at", "2024-02-11 20:41:50.492800"], ["id", 1]]
---
  def update
    @product = Product.find(params[:id])
    if @product.update(product_params)

SELECT "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "products" SET "owner" = $1, "updated_at" = $2 WHERE "products"."id" = $3  [["owner", "67"], ["updated_at", "2024-02-11 20:52:33.493892"], ["id", 2]]
---
  def buy
    @product = Product.find(params[:id])
    @product.owner = current_user.id
    @product.save

SELECT "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "products" SET "owner" = $1, "updated_at" = $2 WHERE "products"."id" = $3  [["owner", nil], ["updated_at", "2024-02-11 20:52:44.453826"], ["id", 3]]
---
  def sell
    @product = Product.find(params[:id])
    @product.owner = nil
    @product.save